Repository: omise/omise-ios
Catalog: OmiseSDK/*.lproj/Error.strings
Languages: ja, th

# credit-card-form.card-holder-name-field.invalid-data.error.text
source: Card holder name is invalid
ja: クレジットカード所有者名が無効です
th: ชื่อผู้ถือบัตรไม่ถูกต้อง

# credit-card-form.card-number-field.invalid-data.error.text
source: Credit card number is invalid
ja: クレジットカード番号が無効です
th: หมายเลขบัตรไม่ถูกต้อง

# credit-card-form.expiry-date-field.invalid-data.error.text
source: Card expiry date is invalid
ja: クレジットカードの有効期限が無効です
th: วันหมดอายุของบัตรไม่ถูกต้อง

# credit-card-form.security-code-field.invalid-data.error.text
source: CVV code is invalid
ja: CVVコードが無効です
th: หมายเลข CVV ไม่ถูกต้อง

# econtext-info-form.email-name-field.invalid-data.error.text
source: Email is invalid
ja: メールが無効です
th: อีเมล์ไม่ถูกต้อง

# econtext-info-form.full-name-field.invalid-data.error.text
source: Customer name is invalid
ja: 顧客名が無効です
th: ชื่อผู้ซื้อไม่ถูกต้อง

# econtext-info-form.phone-number-field.invalid-data.error.text
source: Phone number is invalid
ja: 電話番号が無効です
th: หมายเลขโทรศัพท์ไม่ถูกต้อง

# error.api.authentication_failure.message
source: Authentication failure
ja: 認証失敗
th: การยืนยันตัวตนของร้านค้าไม่ถูกต้อง

# error.api.authentication_failure.recovery-suggestion
source: Please contact the merchant
ja: 加盟店までご連絡ください
th: กรุณาติดต่อเจ้าหน้าที่ของร้านค้า

source: Amount exceeds the valid amount of %@
ja: 金額が%@の有効金額を超過しています
th: ยอดมีจำนวนมากกว่าที่กำหนดไว้ ซึ่งต้องไม่เกิน %@

source: Please create a source with an amount which is less than %@
ja: %@未満の金額でソースを作成してください
th: กรุณาสร้าง source ด้วยจำนวนที่น้อยกว่า %@

source: Amount exceeds the valid amount
ja: 金額が有効金額を超過しています
th: ยอดเงินมีจำนวนมากกว่าที่กำหนดไว้

source: Please create a source with less amount
ja: これより少ない金額でソースを作成してください
th: กรุณาสร้าง source ด้วยจำนวนที่น้อยลง

# error.api.bad_request.amount-is-less-than-valid-amount.with-valid-amount.message
source: Amount is less than the valid amount of %@
th: ยอดมีจำนวนน้อยกว่าที่กำหนดไว้ ซึ่งต้องไม่ต่ำกว่า %@

source: Please create a source with an amount that is greater than %@
ja: %@以上の金額でソースを作成してください
th: กรุณาสร้าง source ด้วยจำนวนที่มากกว่า %@

source: Amount is less than the valid amount
ja: 金額が有効金額以下です
th: ยอดเงินมีจำนวนน้อยกว่าที่กำหนดไว้

source: Please create a source with a greater amount
ja: それ以上の金額でソースを作成してください
th: กรุณาสร้าง source ด้วยจำนวนที่มากกว่า

# error.api.bad_request.currency-not-supported.message
source: The currency is not supported by this account
ja: このアカウントでこちらの通貨はサポートされていません
th: บัญชีผู้ใช้นี้ไม่รองรับสกุลเงินดังกล่าว

# error.api.bad_request.currency-not-supported.recovery-suggestion
source: Please choose another currency
ja: 通貨をご確認ください
th: กรุณาเลือกสกุลเงินอื่น

# error.api.bad_request.empty-name.message
source: The customer name is empty
ja: 顧客名が空白です
th: ไม่มีข้อมูลชื่อผู้ซื้อ

# error.api.bad_request.empty-name.recovery-suggestion
source: Please input customer name
ja: 顧客名を指定してください
th: กรุณากรอกชื่อผู้ซื้อ

# error.api.bad_request.invalid-currency.message
source: The currency is invalid
ja: この通貨は無効です
th: สกุลเงินไม่ถูกต้อง

# error.api.bad_request.invalid-email.message
source: The customer email is invalid
ja: 顧客のメールが無効です
th: อีเมล์ผู้ซื้อไม่ถูกต้อง

# error.api.bad_request.invalid-email.recovery-suggestion
source: Please review the customer email
ja: 顧客のメールをご確認ください
th: กรุณาตรวจสอบอีเมล์ผู้ซื้ออีกครั้ง

# error.api.bad_request.invalid-name.message
source: The customer name is invalid
ja: 顧客名が無効です
th: ชื่อผู้ซื้อไม่ถูกต้อง

# error.api.bad_request.invalid-name.recovery-suggestion
source: Please review the customer name
ja: 顧客名をご確認ください
th: กรุณาตรวจสอบชื่อและตัวสะกดทั้งหมดอีกครั้ง

# error.api.bad_request.invalid-phone-number.message
source: The customer phone number is invalid
ja: 顧客の電話番号が無効です
th: หมายเลขโทรศัพท์ผู้ซื้อไม่ถูกต้อง

# error.api.bad_request.invalid-phone-number.recovery-suggestion
source: Please review the customer phone number
ja: 顧客の電話番号をご確認ください
th: กรุณาตรวจสอบหมายเลขโทรศัพท์ผู้ซื้ออีกครั้ง

# error.api.bad_request.name-is-too-long.with-valid-length.message
source: The customer name exceeds the %d character limit
ja: 顧客名が%d文字の有効数を超過しています
th: ชื่อผู้ซื้อยาวกว่าจำนวนตัวอักษรซึ่งกำหนดไว้ไม่เกิน %d ตัว

# error.api.bad_request.name-is-too-long.with-valid-length.recovery-suggestion
source: Please input customer name which is no longer than %d characters
ja: %d文字数より少ない顧客名を指定してください
th: กรุณาระบุชื่อผู้ซื้อที่มีจำนวนตัวอักษรน้อยกว่า %d ตัว

# error.api.bad_request.name-is-too-long.without-valid-length.message
source: The customer name is too long
ja: 顧客の名前が長すぎます
th: ชื่อผู้ซื้อยาวเกินจำนวนตัวอักษรที่กำหนด

# error.api.bad_request.name-is-too-long.without-valid-length.recovery-suggestion
source: Please input shorter customer name
ja: 顧客の名前を短くしご指定ください
th: กรุณากรอกชื่อผู้ซื้อ

# error.api.bad_request.other.message
source: Bad request: %@
ja: 不正なリクエスト: %@
th: พบข้อขัดข้อง: %@

# error.api.bad_request.type-not-supported.message
source: The source type is not supported by this account
ja: このアカウントでこちらのソースタイプはサポートされていません
th: บัญชีผู้ใช้นี้ไม่รองรับ source ที่ระบุ

# error.api.bad_request.type-not-supported.recovery-suggestion
source: Please review the source type
ja: このソースタイプをご確認ください
th: กรุณาแก้ไข source type

# error.api.invalid_card.empty-card-holder-name.recovery-suggestion
source: Please review the card holder name
ja: カード所有者名をご確認ください
th: กรุณาตรวจสอบความถูกต้องของชื่อและตัวสะกดทั้งหมดอีกครั้ง

# error.api.invalid_card.empty-card-holderName.message
source: Invalid card holder name
ja: 無効なカード所有者名
th: ชื่อผู้ถือบัตรไม่ถูกต้อง

# error.api.invalid_card.invalid-card-number.message
source: Invalid card number
ja: 無効なカード番号
th: หมายเลขบัตรไม่ถูกต้อง

# error.api.invalid_card.invalid-card-number.recovery-suggestion
source: Please review the card number
ja: こちらのカード番号をご確認ください
th: กรุณาตรวจสอบความถูกต้องของหมายเลขบัตรอีกครั้ง

# error.api.invalid_card.invalid-expiration-date.message
source: Invalid card expiration date
ja: 無効なカード有効期限
th: วันหมดอายุบัตรไม่ถูกต้อง

# error.api.invalid_card.invalid-expiration-date.recovery-suggestion
source: Please review the card expiration date
ja: カード有効期限をご確認ください
th: กรุณาตรวจสอบความถูกต้องของวันหมดอายุบัตรอีกครั้ง

# error.api.invalid_card.other.recovery-suggestion
source: Please review credit card information
ja: クレジットカード情報をご確認ください
th: กรุณาตรวจสอบข้อมูลบัตรอีกครั้ง

# error.api.invalid_card.unsupported-brand.message
source: Unsupported card brand
ja: サポートされていないカード会社
th: บัตรเครดิตไม่รองรับ

# error.api.invalid_card.unsupported-brand.recovery-suggestion
source: Please use another credit card
ja: 他のクレジットカードをご利用ください
th: กรุณาใช้บัตรใบอื่นทำรายการ

# error.api.service_not_found.message
source: Service not found
ja: サービスが見つかりません
th: ไม่พบบริการ

# error.api.service_not_found.recovery-suggestion
source: Please contact the merchant
ja: 加盟店までご連絡ください
th: กรุณาติดต่อเจ้าหน้าที่ของร้านค้า

# error.unexpected.http-error-response-with-invalid-data.message
source: Invalid error data in the error response
ja: エラー応答の無効なエラーデータ
th: ผลลัพธ์แสดงว่าคำสั่งไม่สำเร็จและพบว่าข้อมูลชี้แจงข้อขัดข้องไม่ถูกต้อง

# error.unexpected.http-error-response-with-invalid-data.recovery-suggestion
source: Please try again later. If the same problem persists please contact customer support.
th: กรุณาลองทำรายการอีกครั้งในภายหลัง หากยังพบข้อขัดข้องเดิมกรุณาติดต่อเจ้าหน้าที่

# error.unexpected.http-error-with-no-data.message
source: No error data in the error response
ja: エラー応答のエラーデータ無し
th: ผลลัพธ์แสดงว่าคำสั่งไม่สำเร็จและไม่พบข้อมูลชี้แจงข้อขัดข้อง

# error.unexpected.http-error-with-no-data.recovery-suggestion
source: Please try again later. If the same problem persists please contact customer support.
th: กรุณาลองทำรายการอีกครั้งในภายหลัง หากยังพบข้อขัดข้องเดิมกรุณาติดต่อเจ้าหน้าที่

# error.unexpected.http-succeess-with-invalid-data.message
source: Invalid data in the success response
ja: 成功応答の無効なデータ
th: ผลลัพธ์แสดงว่าคำสั่งสำเร็จ แต่พบว่าข้อมูลชี้แจงข้อขัดข้องไม่ถูกต้อง

# error.unexpected.http-succeess-with-invalid-data.recovery-suggestion
source: Please try again later. If the same problem persists please contact customer support.
th: กรุณาลองทำรายการอีกครั้งในภายหลัง หากยังพบข้อขัดข้องเดิมกรุณาติดต่อเจ้าหน้าที่

# error.unexpected.http-succeess-with-no-data.message
source: No data in the success response
ja: 成功応答のデータ無し
th: ผลลัพธ์แสดงว่าคำสั่งสำเร็จ แต่ไม่พบข้อมูล

# error.unexpected.http-succeess-with-no-data.recovery-suggestion
source: Please try again later. If the same problem persists please contact customer support.
th: กรุณาลองทำรายการอีกครั้งในภายหลัง หากยังพบข้อขัดข้องเดิมกรุณาติดต่อเจ้าหน้าที่

# error.unexpected.no-error-norresponse.message
source: No error nor response
ja: エラーや応答無し
th: ไม่พบข้อขัดข้องหรือผลลัพธ์

# error.unexpected.no-error-norresponse.recovery-suggestion
source: Please try again later. If the same problem persists please contact customer support.
th: กรุณาลองทำรายการอีกครั้งในภายหลัง หากยังพบข้อขัดข้องเดิมกรุณาติดต่อเจ้าหน้าที่

# error.unexpected.unrecognized-HTTP-status-code.message
source: Unrecognized/unsupported HTTP status code
ja: 認識されない、もしくはサポートされていないHTTPステータスコード
th: ไม่พบข้อมูล/ไม่รองรับรหัสสถานะ HTTP

# error.unexpected.unrecognized-HTTP-status-code.recovery-suggestion
source: Please try again later. If the same problem persists please contact customer support.
th: กรุณาลองทำรายการอีกครั้งในภายหลัง หากยังพบข้อขัดข้องเดิมกรุณาติดต่อเจ้าหน้าที่

source: Amount is greater than the valid amount of %@
ja: 金額が%@の有効金額を超過しています
th: ยอดมีจำนวนมากกว่าที่กำหนดไว้ ซึ่งต้องไม่เกิน %@

source: The payment amount is too high. Please make a payment with a lower amount.
ja: 決済金額が高すぎます。より低額で決済を行ってください。
th: ยอดชำระสูงกว่าที่กำหนด กรุณาทำรายการใหม่ด้วยยอดที่น้อยลง

source: Amount is greater than the valid amount
ja: 金額が有効金額を超過しています
th: ยอดเงินมีจำนวนมากกว่าที่กำหนดไว้

source: The payment amount is too high. Please make a payment with a lower amount.
ja: 決済金額が高すぎます。より低額で決済を行ってください。
th: ยอดชำระสูงกว่าที่กำหนด กรุณาทำรายการใหม่ด้วยยอดที่น้อยลง

source: Amount is less than the valid amount of %@
ja: 金額が%@の有効金額以下です
th: ยอดมีจำนวนน้อยกว่าที่กำหนดไว้ ซึ่งต้องไม่ต่ำกว่า %@

source: The payment amount is too low. Please make a payment with a higher amount.
ja: 決済金額が低すぎます。より高額で決済を行ってください。
th: ยอดชำระต่ำกว่าที่กำหนด กรุณาทำรายการใหม่ด้วยยอดที่มากขึ้น

source: Amount is less than the valid amount
ja: 金額が有効金額以下です
th: ยอดเงินมีจำนวนน้อยกว่าที่กำหนดไว้

source: The payment amount is too low. Please make a payment with a higher amount.
ja: 決済金額が低すぎます。より高額で決済を行ってください。
th: ยอดชำระต่ำกว่าที่กำหนด กรุณาทำรายการใหม่ด้วยยอดที่มากขึ้น

# payment-creator.error.api.bad_request.currency-not-supported.message
source: The currency is not supported for this account
ja: このアカウントでこちらの通貨はサポートされていません
th: บัญชีผู้ใช้นี้ไม่รองรับสกุลเงินดังกล่าว

# payment-creator.error.api.bad_request.currency-not-supported.recovery-suggestion
source: Please choose another currency
ja: 他の通貨を選択してください
th: กรุณาเลือกสกุลเงินอื่น

# payment-creator.error.api.bad_request.empty-name.message
source: The customer name is empty
ja: 顧客名が空白です
th: ไม่มีข้อมูลชื่อผู้ซื้อ

# payment-creator.error.api.bad_request.empty-name.recovery-suggestion
source: Please fill in the customer name
ja: 顧客名が空白です
th: กรุณากรอกชื่อผู้ซื้อ

# payment-creator.error.api.bad_request.invalid-currency.message
source: The currency is invalid
ja: この通貨は無効です
th: สกุลเงินไม่ถูกต้อง

# payment-creator.error.api.bad_request.invalid-currency.recovery-suggestion
source: Please choose another currency or contact customer support
ja: 他の通貨を選択するか、サポートまでご連絡ください
th: กรุณาเลือกสกุลเงินอื่นหรือติดต่อเจ้าหน้าที่เพื่อขอความช่วยเหลือ

# payment-creator.error.api.bad_request.invalid-email.message
source: The customer email is invalid
ja: 顧客メールが無効です
th: อีเมล์ผู้ซื้อไม่ถูกต้อง

# payment-creator.error.api.bad_request.invalid-email.recovery-suggestion
source: Please review the email
ja: メールをご確認ください
th: กรุณาตรวจสอบอีเมล์ผู้ซื้ออีกครั้ง

# payment-creator.error.api.bad_request.invalid-name.message
source: The customer name is invalid
ja: 顧客名が無効です
th: ชื่อผู้ซื้อไม่ถูกต้อง

# payment-creator.error.api.bad_request.invalid-name.recovery-suggestion
source: Please review the customer name
ja: 顧客名をご確認ください
th: ชื่อผู้ซื้อไม่ถูกต้อง

# payment-creator.error.api.bad_request.invalid-phone-number.message
source: The customer phone number is invalid
ja: 顧客の電話番号が無効です
th: หมายเลขโทรศัพท์ผู้ซื้อไม่ถูกต้อง

# payment-creator.error.api.bad_request.invalid-phone-number.recovery-suggestion
source: Please review the phone number
ja: 電話番号をご確認ください
th: กรุณาตรวจสอบหมายเลขโทรศัพท์ผู้ซื้ออีกครั้ง

# payment-creator.error.api.bad_request.name-is-too-long.recovery-suggestion
source: Please review the customer name
ja: 顧客名をご確認ください
th: กรุณาตรวจสอบชื่อและตัวสะกดทั้งหมดอีกครั้ง

# payment-creator.error.api.bad_request.name-is-too-long.with-valid-length.message
source: The customer name exceeds %d characters
ja: 顧客の名前が%d文字数より長すぎます
th: ชื่อผู้ซื้อยาวกว่า %d ตัวอักษร

source: The customer name is too long
ja: 顧客の名前が長すぎます
th: ชื่อผู้ซื้อยาวเกินจำนวนตัวอักษรที่กำหนด

# payment-creator.error.api.bad_request.other.message
source: Unknown error occurred
ja: 不明なエラーが発生しました
th: พบข้อขัดข้อง: %@

# payment-creator.error.api.bad_request.other.recovery-suggestion
source: Please try again later
ja: 後ほどお試しください
th: กรุณาลองทำรายการอีกครั้งในภายหลัง

# payment-creator.error.api.bad_request.type-not-supported.message
source: The source type is not supported by this account
ja: このアカウントでこちらのソースタイプはサポートされていません
th: บัญชีผู้ใช้นี้ไม่รองรับ source ที่ระบุ

# payment-creator.error.api.bad_request.type-not-supported.recovery-suggestion
source: Please contact customer support
ja: サポートまでご連絡ください
th: กรุณาติดต่อเจ้าหน้าที่เพื่อขอความช่วยเหลือ

# payment-creator.error.api.invalid_card.empty-card-holder-name.message
source: Invalid card holder name
ja: カード所有者名が無効です
th: ชื่อผู้ถือบัตรไม่ถูกต้อง

source: Please review the card holder name
ja: カード所有者名をご確認ください
th: กรุณาตรวจสอบความถูกต้องของชื่อและตัวสะกดทั้งหมดอีกครั้ง

# payment-creator.error.api.invalid_card.invalid-card-number.message
source: Invalid card number
ja: カード番号が無効です
th: หมายเลขบัตรไม่ถูกต้อง

# payment-creator.error.api.invalid_card.invalid-card-number.recovery-suggestion
source: Please review the card number
ja: カード番号をご確認ください
th: กรุณาตรวจสอบความถูกต้องของหมายเลขบัตรอีกครั้ง

# payment-creator.error.api.invalid_card.invalid-expiration-date.message
source: Invalid card expiration date
ja: カード有効期限が無効です
th: วันหมดอายุของบัตรไม่ถูกต้อง

source: Please review the card expiration date again.
ja: カード有効期限をご確認ください
th: กรุณาตรวจสอบความถูกต้องของวันหมดอายุบัตรอีกครั้ง

# payment-creator.error.api.invalid_card.other.message
source: An unknown error occured
ja: 不明なエラーが発生しました
th: พบข้อขัดข้อง

# payment-creator.error.api.invalid_card.other.recovery-suggestion
source: Please try again later
ja: 後ほどお試しください
th: กรุณาลองทำรายการอีกครั้งในภายหลัง

# payment-creator.error.api.invalid_card.unsupported-brand.message
source: Unsupported card brand
ja: サポートされていないカード会社です
th: บัตรเครดิตไม่รองรับ

# payment-creator.error.api.invalid_card.unsupported-brand.recovery-suggestion
source: Please use another card
ja: 他のカードをご利用ください
th: กรุณาใช้บัตรใบอื่นทำรายการ

# payment-creator.error.api.unexpected.message
source: An unexpected error occured
ja: 予期しないエラーです
th: พบข้อขัดข้อง

# payment-creator.error.api.unexpected.recovery-suggestion
source: Please try again later
ja: 後ほどお試しください
th: กรุณาลองทำรายการอีกครั้งในภายหลัง

# payment-creator.error.api.unknown.message
source: An unknown error occured
ja: 不明なエラーが発生しました
th: พบข้อขัดข้อง

# payment-creator.error.api.unknown.recovery-suggestion
source: Please try again later
ja: 後ほどお試しください
th: กรุณาลองทำรายการอีกครั้งในภายหลัง

# payment-creator.error.unexpected.message
source: An unexpected error occurred
ja: 予期しないエラー
th: พบข้อขัดข้อง

# payment-creator.error.unexpected.recovery-suggestion
source: Please try again later
ja: 予期しないエラー
th: กรุณาลองทำรายการอีกครั้งในภายหลัง

# truemoney-form.phone-number-field.invalid-data.error.text
source: Phone number is invalid
ja: 電話番号が無効です

# error.api.bad_request.invalid-currency.recovery-suggestion
source: Bad request
ja: 不正なリクエスト
