Repository: omise/omise-ios
Catalog: OmiseSDK/*.lproj/Localizable.strings
Languages: th

# econtext.convenience-store.navigation-item.title
source: Konbini
th: ร้านสะดวกซื้อ

# econtext.netbanking.navigation-item.title
source: Net Bank
th: เน็ตแบงก์

# econtext.pay-easy.navigation-item.title
source: Pay-easy
th: เพย์อีซี

# installment-number-of-terms-choosers.bay.navigation-item.title
source: Bangkok Bank
th: ธนาคารกรุงเทพ

# installment-number-of-terms-choosers.bbl.navigation-item.title
source: Krungsri
th: ธนาคารกรุงศรี

# installment-number-of-terms-choosers.default.navigation-item.title
source: Installment terms
th: ระยะเวลาผ่อนชำระ

# installment-number-of-terms-choosers.first-choice.navigation-item.title
source: Kasikorn
th: ธนาคารกสิกรไทย

# installment-number-of-terms-choosers.k-bank.navigation-item.title
source: KTC
th: เคทีซี

# installment-number-of-terms-choosers.ktc.navigation-item.title
source: Krungsri First Choice
th: กรุงศรีเฟิร์สช้อยส์

# installments.number-of-terms-chooser.number-of-terms-cell.label.text
source: %d months
th: %d เดือน

# more-info.cvv-location.amex.text
source: 4 digit number on the front of your card
th: หมายเลข 4 หลักบนหน้าบัตร

# more-info.cvv-location.default.text
source: 3 digit number on the back of your card
th: หมายเลข 3 หลักด้านหลังบัตร
