Repository: omise/omise-ios
Catalog: OmiseSDK/Resources/*.lproj/Localizable.strings
Languages: ja, th

# PaymentMethods.title
source: Payment Methods
ja: 決済方法
th: ช่องทางชำระเงิน

# PaymentMethod.creditCard
source: Credit Card
ja: クレジットカード
th: บัตรเครดิต

# PaymentMethod.installments
source: Installments
ja: 分割払い
th: ผ่อนชำระ

# PaymentMethod.internetBanking
source: Internet Banking
ja: インターネットバンク

# PaymentMethod.mobileBanking
source: Mobile Banking
ja: モバイルバンキング
th: โมบายแบงก์กิ้ง

# PaymentMethod.eContext.conbini
source: Konbini
ja: コンビニ
th: ร้านสะดวกซื้อ

# PaymentMethod.eContext.payEasy
source: Pay-easy
ja: ペイジー
th: เพย์อีซี

# PaymentMethod.eContext.netBanking
source: Net Bank
ja: ネットバンク
th: เน็ตแบงก์

# SourceType.alipay
source: Alipay Online
ja: アリペイオンライン
th: อาลีเพย์ (ออนไลน์)

# SourceType.alipay.footnote
source: (Alipay+™ Partner)
ja: (アリペイプラス)
th: (อาลีเพย์พลัส)

# SourceType.bill_payment_tesco_lotus
source: Lotus's Bill Payment
ja: ロータス
th: โลตัสบิลเพย์เมนต์

# SourceType.installment_bay
source: Krungsri
ja: クルンシィ
th: ธนาคารกรุงศรี

# SourceType.installment_bbl
source: Bangkok Bank
ja: バンコク銀行
th: ธนาคารกรุงเทพ

# SourceType.installment_first_choice
source: Krungsri First Choice
ja: クルンシィ・ファーストチョイス
th: กรุงศรีเฟิร์สช้อยส์

# SourceType.installment_kbank
source: Kasikorn Bank
ja: カシコン銀行
th: ธนาคารกสิกรไทย

# SourceType.installment_ktc
source: KTC
ja: クルンタイカード
th: เคทีซี

# SourceType.installment_scb
source: Siam Commercial Bank
ja: サイアム・コマーシャル銀行
th: ธนาคารไทยพาณิชย์

# SourceType.installment_ttb
source: TMBThanachart Bank
ja: TMBタナチャート銀行
th: ธนาคารทีเอ็มบีธนชาต

# SourceType.installment_uob
source: United Overseas Bank
ja: ユナイテッド・オーバーシーズ銀行
th: ธนาคารยูโอบี

# SourceType.installment_wlb_ktc
source: KTC
ja: クルンタイカード
th: เคทีซี

# SourceType.installment_wlb_kbank
source: Kasikorn Bank
ja: カシコン銀行
th: ธนาคารกสิกรไทย

# SourceType.installment_wlb_scb
source: Siam Commercial Bank
ja: サイアム・コマーシャル銀行
th: ธนาคารไทยพาณิชย์

# SourceType.installment_wlb_bbl
source: Bangkok Bank
ja: バンコク銀行
th: ธนาคารกรุงเทพ

# SourceType.installment_wlb_bay
source: Krungsri
ja: クルンシィ

# SourceType.installment_wlb_first_choice
source: Krungsri First Choice
ja: クルンシィ・ファーストチョイス

# SourceType.installment_wlb_ttb
source: TMBThanachart Bank
ja: TMBタナチャート銀行

# SourceType.installment_wlb_uob
source: United Overseas Bank
ja: ユナイテッド・オーバーシーズ銀行
th: ธนาคารยูโอบี

# SourceType.internet_banking_bay
source: Bank of Ayudhya
ja: アユタヤ銀行

# SourceType.internet_banking_bbl
source: Bangkok Bank
ja: バンコク銀行

# SourceType.points_citi
source: Pay with Citi Rewards Points
ja: Citi Rewardsポイント
th: ชำระด้วยคะแนนซิตี้รีวอร์ด

# SourceType.promptpay
source: PromptPay
ja: プロンプトペイ
th: พร้อมเพย์

# SourceType.truemoney
source: TrueMoney Wallet
ja: TrueMoneyウォレット
th: ทรูมันนี่วอลเล็ท

# SourceType.alipay_cn
source: Alipay
ja: アリペイ
th: อาลีเพย์

# SourceType.alipay_hk
source: AlipayHK
ja: アリペイ香港
th: อาลีเพย์ฮ่องกง

# SourceType.dana
source: DANA
ja: ダナ
th: ดานา

# SourceType.gcash
source: GCash
ja: ジーキャッシュ
th: จีแคช

# SourceType.installment_mbb
source: Maybank
ja: メイバンク
th: เมย์แบงก์

# SourceType.kakaopay
source: Kakao Pay
ja: カカオペイ
th: กาเกาเพย์

# SourceType.touch_n_go
source: Touch ’n Go
ja: タッチンゴー
th: ทัชแอนด์โก

# CreditCard.field.country
source: Country or region
ja: 国または地域
th: ประเทศหรือภูมิภาค

# CreditCard.field.address
source: Address
ja: 住所
th: ที่อยู่

# CreditCard.field.address.error
source: Address is required
ja: 住所は必須です
th: ต้องระบุที่อยู่

# CreditCard.field.city
source: City
ja: 市
th: จังหวัด

# CreditCard.field.city.error
source: City is required
ja: 市が必要です
th: ต้องระบุเมือง

# CreditCard.field.state
source: State
ja: 州
th: เขต

# CreditCard.field.state.error
source: State is required
ja: 州が必要です
th: ต้องระบุเขต

# CreditCard.field.postalCode
source: Zip code / Postal code
ja: 郵便番号
th: รหัสไปรษณีย์

# CreditCard.field.postalCode.error
source: Zip code / Postal code is required
ja: 郵便番号が必要です
th: ต้องระบุรหัสไปรษณีย์

# CreditCard.field.cardNumber
source: Card number
ja: カード番号
th: หมายเลขบัตร

# CreditCard.field.nameOnCard
source: Name on card
ja: カード名義
th: ชื่อบนบัตร

# CreditCard.field.expiryDate
source: Expiry date
ja: 有効期限
th: หมดอายุ

# CreditCard.field.securityCode
source: Security code
ja: セキュリティコード
th: รหัสความปลอดภัย

# CreditCard.payButton.title
source: Pay
ja: 支払う
th: ชำระเงิน

# CreditCard.cvv.details.amex.text
source: 4 digit number on the front of your card
ja: カード表面の4桁の番号
th: หมายเลข 4 หลักบนหน้าบัตร

# CreditCard.cvv.details.default.text
source: 3 digit number on the back of your card
ja: カード裏面の3桁の番号
th: หมายเลข 3 หลักด้านหลังบัตร

# EContext.field.fullName
source: Full name
ja: 氏名
th: ชื่อ-สกุล

# EContext.field.email
source: Email
ja: メール
th: อีเมล์

# EContext.field.phone
source: Phone
ja: 電話
th: โทร.

# EContext.nextButton.title
source: Next
ja: 次
th: ถัดไป

# TrueMoneyWallet.field.phoneNumber
source: Phone number
ja: 電話
th: โทร.

# TrueMoneyWallet.nextButton.title
source: Next
ja: 次
th: ถัดไป

# TrueMoneyWallet.label.pleaseInput.text
source: Please input the mobile number connected to your TrueMoney Wallet account
ja: TrueMoney ウォレットアカウントに登録されている携帯電話番号を入力してください
th: กรุณากรอกหมายเลขโทรศัพท์ที่ผูกกับบัญชีทรูมันนี่วอลเล็ท

# Atome.header.text
source: Please input the below information to complete the charge creation with Atome
ja: Atomeによるお支払いを完了させるには、以下の情報をご記入ください。
th: กรุณาใส่ข้อมูลเพื่อสร้างรายการเรียกเก็บเงินกับ Atome ให้เสร็จสมบูรณ์

# Atome.field.name
source: Name
ja: 名前
th: ชื่อ

# Atome.field.email
source: Email
ja: メールアドレス
th: อีเมล

# Atome.field.phoneNumber
source: Phone Number
ja: 電話番号
th: หมายเลขโทรศัพท์

# Atome.field.country
source: Country
ja: 国
th: ประเทศ

# Atome.field.city
source: City
ja: 市区郡
th: เมือง

# Atome.field.postalCode
source: Postal code
ja: 郵便番号
th: รหัสไปรษณีย์

# Atome.field.state
source: State
ja: 州
th: รัฐ

# Atome.field.street1
source: Street
ja: 通り名
th: ถนน

# Atome.field.street2
source: Street 2
ja: 通り名 2
th: ที่อยู่ - เพิ่มเติม

# Atome.shippingAddress
source: Shipping address
ja: 配送先
th: ที่อยู่สำหรับจัดส่งสินค้า

# Atome.submitButton.title
source: Next
ja: 次へ
th: ดำเนินการต่อ

# Atome.field.email.error
source: Email is invalid
ja: メールアドレスが無効です
th: อีเมลไม่ถูกต้อง

# Atome.field.phoneNumber.error
source: Please enter valid phone number
ja: 有効な電話を入力してください
th: กรุณาใส่หมายเลขโทรศัพท์ที่ถูกต้อง

# Atome.field.country.error
source: Shipping country is required
ja: 配送先の市区郡名が必要です
th: จำเป็นต้องใส่ชื่อประเทศสำหรับจัดส่งสินค้า

# Atome.field.city.error
source: Shipping city is required
ja: 配送先の都市名が必要です
th: จำเป็นต้องใส่ชื่อเมืองสำหรับจัดส่งสินค้า

# Atome.field.postalCode.error
source: Shipping postal code is required
ja: 配送先の郵便番号が必要です
th: จำเป็นต้องใส่รหัสไปรษณีย์สำหรับจัดส่งสินค้า

# Atome.field.state.error
source: Shipping state is required
ja: 配送先の州名が必要です
th: จำเป็นต้องใส่ชื่อรัฐสำหรับจัดส่งสินค้า

# Atome.field.street1.error
source: Shipping street is required
ja: 配送先の通り名が必要です
th: จำเป็นต้องใส่ชื่อถนนสำหรับจัดส่งสินค้า

# Atome.field.optional
source: (optional)
ja: (任意)
th: (ถ้ามี)

# Atome.field.billingCountry
source: Country
ja: 国
th: ประเทศ

# Atome.field.billingCity
source: City
ja: 市区郡
th: เมือง

# Atome.field.billingPostalCode
source: Postal code
ja: 郵便番号
th: รหัสไปรษณีย์

# Atome.field.billingState
source: State
ja: 州
th: รัฐ

# Atome.field.billingStreet1
source: Street
ja: 通り名
th: ถนน

# Atome.field.billingStreet2
source: Street 2
ja: 通り名 2
th: ที่อยู่ - เพิ่มเติม

# fpx.bank-chooser.no-banks-available.text
source: Cannot retrieve list of banks. Please try again later.
ja: 銀行のリストを検索できません。後でもう一度お試しください。
th: ไม่สามารถเรียกข้อมูลรายชื่อธนาคารได้ในขณะนี้ กรุณาลองใหม่อีกครั้ง

# fpx.field.email
source: Email (Optional)
ja: メールアドレス (任意)
th: อีเมล (ถ้ามี)

# fpx.nextButton.title
source: Next
ja: 次
th: ถัดไป

# fpx.label.pleaseInput.text
source: Please input your email to receive transaction confirmation from FPX
ja: メールアドレスを入力し、FPXからの取引確認メールを受信します
th: กรุณากรอกอีเมลเพื่อรับการยืนยันการรับชำระจากเอฟพีเอ็กซ์

# AuthorizingPayment.title
source: Authorizing Payment
ja: 決済の認可
th: กำลังอนุมัติวงเงิน

# ApplePay.not.available.text
source: Apple Pay is not available on this device
ja: この端末ではApple Payはご利用いただけません
th: ไม่สามารถใช้งาน Apple Pay ได้บนอุปกรณ์นี้

# SourceType.paynow
source: PayNow
th: เพย์นาว

# SourceType.truemoney_jumpapp
source: TrueMoney
th: ทรูมันนี่

# CreditCard.field.mmyy.placeholder
source: MM/YY
th: ดด/ปป

# Atome.billingAddress
source: Billing address (optional)
th: ที่อยู่สำหรับส่งใบแจ้งหนี้ (ไม่จำเป็น)

# Atome.field.billing.the.same
source: My billing and shipping address are the same.
th: ใช้ที่อยู่เดียวกันสำหรับจัดส่งสินค้าและใบแจ้งหนี้
